# Brewfile - Declarative Homebrew package management
# Brewfile-core - items that should work across Mac and Linux
#
# Usage:
# 1. Install all listed packages: `brew bundle install --file=~/.config/brew/Brewfile`
# 2. Remove unlisted packages (except VS Code extensions): 
#    `brew bundle cleanup --file=~/.config/brew/Brewfile --force && ~/bin/sync-vscode-extensions.sh`
# 3. Update this file with current packages: `brew bundle dump --file=~/.config/brew/Brewfile --force`
# 4. Sync VS Code extensions separately: `~/bin/sync-vscode-extensions.sh`
# 5. **Do it all at once (install, cleanup, sync VS Code extensions)**:
#    `brew bundle install --cleanup --file=~/.config/brew/Brewfile && ~/bin/sync-vscode-extensions.sh`
#
# Notes:
# - `brew` entries are command-line utilities.
# - `cask` entries are macOS GUI applications.
# - `mas` entries are Mac App Store applications.
# - `vscode` entries install VS Code extensions.
#
# Warning: `brew bundle cleanup --force` will remove anything not listed here (except VS Code extensions).

brew "ansible"
brew "ansible-lint"
brew "aria2"
brew "autoconf"
brew "bat"
brew "block-goose-cli"
brew "glib"
brew "codex"
brew "curl"
brew "detox"
#brew "docker"
#brew "docker-compose"
# brew "docutils"
# brew "duf"
# brew "dust"
# brew "eza"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "freetds"
brew "fzf"
brew "gdu"
brew "gh"
brew "g-ls"
brew "git"
brew "git-delta"
brew "gnupg"
brew "gnutls"
brew "go"
brew "gotop"
# brew "pkg-config"
brew "htop"
brew "imagemagick"
# brew "irssi"
brew "janet"
brew "jq"
brew "kanata"
# brew "lima"
brew "lf"
brew "llm"
brew "mdformat"
brew "moreutils"
# brew "ncdu"
brew "node"
brew "nmap"
brew "nvim"
brew "ollama"
brew "pipx"
brew "pandoc"
brew "qrencode"
brew "ripgrep"
brew "rustup"
brew "shellcheck"
# brew "slashem"
# brew "smartmontools"
# brew "telnet"
brew "tealdeer"
# brew "tmux"
# brew "tmuxp"
brew "tgpt"
brew "tokei"
brew "tree"
brew "tut"
# brew "unar"
brew "virtualenv"
brew "wget"
brew "wireguard-tools"
brew "xdg-ninja"
brew "yadm"
brew "yamllint"
brew "yt-dlp"
brew "zlib"
brew "zoxide"
brew "zsh-completions"

vscode "davidanson.vscode-markdownlint"
vscode "mechatroner.rainbow-csv"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cmake-tools"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.powershell"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.powershell"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"


vscode "dracula-theme.theme-dracula"
vscode "anthropic.claude-code"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "monosans.djlint"
vscode "samuelcolvin.jinjahtml"
vscode "yzhang.markdown-all-in-one"
